export const Executors = [
    'Иванов',
    'Петров',
    'Сидоров',
    'Миша',
    'Маша',
];

export const Project_kinds = [
    'ПЗЗ',
    'ГП',
    'ППиПМ',
    'СТП',
];

export const Districts = [
    'Абзелиловский',
    'Альшеевский',
    'Архангельский',
    'Аскинский',
    'Аургазинский',
    'Бакалинский',
    'Балтачевский',
    'Белебеевский',
    'Белокатайский',
    'Белорецкий',
    'Бижбулякский',
    'Бирский',
    'Благоварский',
    'Благовещенский',
    'Буздякский',
    'Бураевский',
    'Бурзянский',
    'Гафурийский',
    'Ермекеевский',
    'Давлекановский',
    'Дуванский',
    'Дюртюлинский',
    'Зианчуринский',
    'Зилаирский',
    'Иглинский',
    'Илишевский',
    'Ишимбайский',
    'Калтасинский',
    'Караидельский',
    'Кармаскалинский',
    'Кигинский',
    'Краснокамский',
    'Красноусольский',
    'Кугарчинский',
    'Кушнаренковский',
    'Мелеузовский',
    'Мечетлинский',
    'Мишкинский',
    'Миякинский',
    'Нуримановский',
    'Татышлинский',
    'Туймазинский',
    'Салаватский',
    'Стерлибашевский',
    'Федоровский',
    'Хайбуллинский',
    'Чекмагушевский',
    'Чишминский',
    'Шаранский',
    'Янаульский'
];

export enum FieldKind {
    String = "String",
    Number = "Number",
    Boolean = "Boolean",
    Date = "Date"
}

export const FieldKindLabels = [
    {
        kind: FieldKind.String,
        label: 'Строка'
    },
    {
        kind: FieldKind.Number,
        label: 'Число'
    },
    {
        kind: FieldKind.Boolean,
        label: 'Да/Нет'
    },
    {
        kind: FieldKind.Date,
        label: 'Дата'
    },
];
